{
  "$type": "community.lexicon.reviews.main",
  "subject": {
    "type": "service",
    "uri": "at://did:plc:servicedir/app.bsky.services/service321",
    "name": "UrbanRenew Home Renovation"
  },
  "rating": 5,
  "content": "I hired UrbanRenew to completely renovate my kitchen, and the entire experience exceeded my expectations. From the initial consultation to the final walkthrough, their communication was exceptional - I always knew what was happening and when. The project manager, David, was responsive and addressed any concerns immediately. Their attention to detail was impressive, particularly in the custom cabinetry and tile work. What truly set them apart was how they handled unexpected challenges - when they discovered water damage behind the old cabinets, they presented multiple solutions with transparent pricing and timeline impacts. They stayed on schedule (completed in 6 weeks as promised) and the final cost matched the original quote with only the agreed-upon changes. The crew was respectful of our home, cleaning thoroughly each day. The finished kitchen is not only beautiful but functional, with thoughtful suggestions they made during the design phase that I wouldn't have considered. I've already recommended them to several friends.",
  "media": [
    {
      "image": {
        "$type": "blob",
        "ref": {
          "$link": "bafkreihgfxcv7y25243qdmlc7pp2tbjqumcjbeprhwmqbgvs6c2xmcmkitchen1"
        },
        "mimeType": "image/jpeg",
        "size": 876512
      },
      "alt": "Before photo - outdated kitchen with laminate countertops"
    },
    {
      "image": {
        "$type": "blob",
        "ref": {
          "$link": "bafkreib2g45vnxaq3dmlc7pp2tbjqumcjbeprhwmqbgvs6c2xmcmkitchen2"
        },
        "mimeType": "image/jpeg",
        "size": 912376
      },
      "alt": "After photo - renovated kitchen with quartz countertops and custom cabinets"
    },
    {
      "image": {
        "$type": "blob",
        "ref": {
          "$link": "bafkreibwxyzabcd3dmlc7pp2tbjqumcjbeprhwmqbgvs6c2xmcmworkmanship"
        },
        "mimeType": "image/jpeg",
        "size": 765432
      },
      "alt": "Close-up of detailed tile backsplash workmanship"
    }
  ],
  "verifiedPurchase": true,
  "allowSyndication": true,
  "license": {
    "type": "cc-by-nd",
    "uri": "https://creativecommons.org/licenses/by-nd/4.0/"
  },
  "categories": ["renovation", "kitchen", "contractor", "home-improvement", "custom-design"],
  "metrics": {
    "quality": 5,
    "service": 5,
    "value": 4
  },

  "response": {
    "content": "Thank you for trusting us with your kitchen renovation! We're delighted that you're happy with both the process and the result. Your home presented some unique design opportunities, and it was a pleasure working with you to create a kitchen that fits your lifestyle perfectly. We especially appreciate you highlighting our team's communication and problem-solving - these are values we prioritize. Thank you for the recommendations to your friends!",
    "respondentName": "Michael Torres",
    "respondentRole": "Owner, UrbanRenew",
    "respondedAt": "2025-03-12T16:45:22.123Z"
  },
  "disclosures": {
    "receivedFree": false,
    "sponsoredContent": false
  },
  "locationContext": {
    "name": "Portland, OR",
    "countryCode": "US"
  },
  "recommended": true,
  "visitDate": "2025-02-01T00:00:00.000Z",
  "createdAt": "2025-03-10T18:22:15.456Z"
}